'use strict';

(function () {

  // LEVELS 1 - 3 

  // Fireball (math operation)
  const mathOperations = {
    simple: ["+", "-"],
    difficult:  ["*", "/"]
  };
  
  // Arrow (match country-capital)
  const capitals = {
    level1:{
      "Беларусь": "минск",
      "Великобритания": "лондон",
      "Германия": "берлин",
      "Испания": "мадрид",
      "Италия": "рим",
      "Латвия": "рига",
      "Нидерланды": "амстердам",
      "Норвегия": "осло",
      "Польша": "варшава",
      "Россия": "москва",
      "Украина": "киев",
      "Франция": "париж",
      "Чехия": "прага",
      "Швеция": "стокгольм",
      "Япония": "токио"
    },
    level2: {
      "Австрия": "вена",
      "Бельгия": "брюссель",
      "Венгрия": "будапешт",
      "Греция": "афины",
      "Дания": "копенгаген",
      "Египет": "каир",
      "Израиль": "иерусалим",
      "Ирландия": "дублин",
      "Китай": "пекин",
      "Португалия": "лиссабон",
      "США": "вашингтон",
      "Турция": "анкара",
      "Финляндия": "хельсинки",
      "Швейцария": "берн",
      "Эстония": "таллин"
    },
    level3: {
      "Австралия": "канберра",
      "Аргентина": "буэнос-айрес",
      "Армения": "ереван",
      "Бразилия": "бразилиа",
      "Ватикан": "ватикан",
      "Грузия": "тбилиси",
      "Индия": "нью-дели",
      "Исландия": "рекьявик",
      "Казахстан": "астана",
      "Канада": "оттава",
      "Мексика": "мехико",
      "Монако": "монако",
      "Сингапур": "сингапур",
      "Словакия": "братислава",
      "Словения": "любляна"
    }
  };
  
  // Lightning (match translation)
  const dictionary = {
    level1: {
      "cat": ["кошка", "кот", "котик", "котёнок", "котенок", "кошечка"],
      "dog": ["собака", "собачка", "собачонка", "пес", "пёс", "песик", "пёсик"],
      "pen": ["ручка", "перо"],
      "sun": ["солнце", "солнышко"],
      "rain": ["дождь", "дождик"],
      "smile": ["улыбка"],
      "mouse": ["мышь", "мышка", "мышонок"],
      "apple": ["яблоко", "яблочко"],
      "ball": ["мяч", "мячик"],
      "banana": ["банан"],
      "bed": ["кровать", "постель", "кроватка"],
      "doll": ["кукла", "куколка"],
      "fox": ["лисица", "лисичка", "лис"],
      "frog": ["лягушка", "лягушонок"],
      "friend": ["друг", "подруга", "дружок"],
      "home": ["дом"],
      "horse": ["лошадь", "конь", "лошадка"],
      "leg": ["нога", "ножка"],
      "monkey": ["обеньяна", "обезьянка", "макака"],
      "pig": ["свинья", "свинка"]
    },
    level2: {
      "blanket": ["одеяло", "одеялко"],
      "foot": ["стопа", "нога", "ножка"],
      "exercise": ["упражнение", "тренировка", "задача", "задание"],
      "eye": ["глаз", "глазик"],
      "hen": ["курица", "курочка"],
      "constter": ["письмо", "буква"],
      "animal": ["животное", "зверь"],
      "blackboard": ["доска"],
      "boat": ["лодка"],
      "butterfly": ["бабочка"],
      "carpet": ["ковер", "ковёр", "коврик"],
      "clock": ["часы"],
      "driver": ["водитель", "шофер", "шофёр"],
      "ice cream": ["мороженое", "морожко"],
      "number": ["номер", "число", "количество", "цифра"],
      "pilot": ["пилот", "летчик", "лётчик"],
      "plane": ["самолет"],
      "puppy": ["щенок", "собачка"],
      "sheep": ["овца", "овечка"],
      "ship": ["корабль", "лодка"],
    },
    level3: {
      "ceiling": ["потолок"],
      "circus": ["цирк"],
      "gun": ["орудие", "ружье", "пистолет", "пулемет", "пулемёт", "пушка"],
      "window.utils.hide-and-seek": ["прятки"],
      "leaf": ["лист", "листик"],
      "nut": ["орех", "орешек"],
      "fridge": ["холодильник"],
      "ruler": ["линейка", "линеечка"],
      "snowman": ["снеговик"],
      "snowball": ["снежок", "снежки"],
      "tail": ["хвост", "хвотик", "коса"],
      "tie": ["галстук", "лента", "шнур"],
      "wolf": ["волк", "волчонок"],
      "top": ["верх"],
      "trick": ["трюк", "фокус", "хитрость", "обман", "шалость"],
      "wall": ["стена", "стенка"],
      "juice": ["сок"],
      "heat": ["жара", "зной"],
      "skirt": ["юбка", "юбочка", "юбчонка"],
      "shirt": ["рубашка", "сорочка", "блузка", "рубаха"]  
    }
  };
  
  // Snowball (spell-task)
  const spellСheck = {
    level1: ["карандаш", "малыш","каток","снежинка", "ягоды", "лыжи","пушистый","мороз","собака","снег","весна","зубки", "шубка","воробей",
  "рыбка","друг","сосна","дерево", "ручка", "улыбка"],
    level2: ["благодарю","сердце","пароход","рожь","чаепитие","мышь","птицы","сделать","жарко","ходить","девчонка","юбчонка","зайчонок",
  "все",  "ясли","тишина", "дюймовочка", "сучья", "цепочка", "подсвечник"],
    level3: [ "отличник", "пожалуйста",  "банщик", "нянчит", "птенчик", "капель", "солнце", "кофта","яблонька", "фонарщик", "сварщик", "крыльцо","когти","ушки","помогать","будка","сторожить","светильник","кольцо","тире"]
  };
  
  // Poison (insert letter)
  const insertLetter = {
    level1:{
      "л_са" : "и",
      "н_ра" : "о",
      "ск_ла" : "а",
      "сл_за" : "е",
      "_кно" : "о",
      "б_рега" : "е",
      "бл_ны" : "и",
      "гр_чи" : "а",
      "ст_лы" : "о",
      "гр_бы" : "и",
      "кр_чали" : "и",
      "см_трели" : "о",
      "св_стели" : "и",
      "шар_" : "ф",
      "св_тили" : "е"
    },
    level2: {
      "л_сная" : "е",
      "пч_ла" : "е",
      "ш_ровая" : "а",
      "д_машняя" : "о",
      "цв_тная" : "е",
      "ст_пная" : "е",
      "пруж_на" : "и",
      "сл_ды" : "е",
      "м_шь" : "ы",
      "пуш_нка" : "и",
      "ж_раф" : "и",
      "ч_сло" : "и",
      "зм_я" : "е",
      "гл_за" : "а",
      "с_рока" : "о"
    },
    level3: {
      "сугро_" : "б",
      "моро_" : "з",
      "обе_" : "д",
      "кувш_н" : "и",
      "рыж_к" : "и",
      "площ_дь" : "а",
      "сч_стье" : "а",
      "спич_ка" : "",
      "рож_" : "ь",
      "нож_" : "",
      "лож_" : "ь",
      "уро_" : "к",
      "сапо_" : "г",
      "пля_" : "ж",
      "вр_чи" : "а"
    }
  };
  
  // Rain (match speech part)
  const speechPart = {
   "существительное": ["сила", "разговор","белок","изготовитель","снег","марте","ручьи","ветерок","парту","малина","ветров","дерева",      "свисток","внуку","существительное","поля","лес","плод","землю","бес"],
  
   "глагол": ["осилить", "говорить","белить","готовить","темнеет","подул","бегут","обуглился","идет","поспело","упал","сидели","защищает","положил","сделала","синеет","светает","мастерит","рос","пряталось"],
  
   "прилагательное": ["силовой", "разговорный","белый","готовый","рыхлый","теплый","весенний","зелёной","чистому","спелый","сладкая","злых","существенное","младшему","белый","круглым","чайную","рыжему","крутой","знакомый"],
  
   "предлог": ["в", "по","к","без","из","из-за","благодаря","между","под","мимо","навстречу","назад","о","за","ради","несмотря","вокруг","после","кроме","около"]
  };

  // LEVEL 4 
  
  // Snowball (Phonetic analysis)
  const phoneticAnalysis = ["жуки", "лыжи", "его", "вести", "арбуз", "сон", "весна", "ветки", "ветер", "дуб", "заря", "имя", "Зоя", "зуб", "ключ", "май", "мёд", "ряд", "пыль", "хвою", "объезд", "вьюга", "рыхлый", "праздный", "революция", "автобус", "здравствуй", "весенний", "варенье", "высокий", "яблоня", "чувство", "солнце", "человек", "соловей", "тяжесть", "тишина", "птичьи", "праздник", "серёжки", "ящерица", "ярмарка", "чудесный", "транскрипция", "телевизор", "счастливый", "презентация", "согласные", "скворечник", "орфография", "объявление", "медвежонок", "компьютер", "возвращался", "бутерброд", "эвакуация", "пешеходная", "опротивевший", "высококлассный", "потрясающий"];
  
  const lettersTypes = ["гласная", "согласная", "другое"];
  const alphabet = {
    "гласная": ["а", "о", "и", "е", "ё", "э", "ы", "у", "ю", "я"],
    "согласная": ["б", "в", "г", "д", "ж", "з", "й", "к", "л", "м", "н", "п", "р", "с", "т", "ф", "х", "ц", "ч", "ш", "щ"],
    "другое": ["ь", "ъ"]
  };

  // Rain (Compose a word from letters)
  const lettersToCompose = [["лиса", "исла"], ["шапка", "кпааш"], ["чашка", "аашчк"], ["щука", "укащ"], ["флаг", "лагф"], ["цепь", "епьц"], ["олень", "еьнло"], ["перец", "рецпе"], ["панда", "ндаап"], ["собака", "бксоаа"], ["щенок", "окнещ"], ["машина", "шниаам"], ["козёл", "зёлок"], ["дыня", "ыянд"], ["муха", "умха"], ["банан", "нанаб"], ["ворона", "рноаов"], ["жаба", "ажаб"], ["хлеб", "лебх"]];

  // Lightning (Match translation)
  const translation = {
    "fox" : ["cat", "fox", "glass"],
    "pig" : ["pig", "bread", "bird"],
    "cup" : ["cup", "elephant", "bag"],
    "cheese" : ["sofa", "duck", "cheese"],
    "apple" : ["apple", "monkey", "dress"],
    "dog" : ["book", "lion", "dog"],
    "cat" : ["picture", "crocodile", "cat"],
    "cow" : ["nose", "fish", "cow"],
    "mouse" : ["arm", "mouse", "chicken"],
    "chair" : ["head", "snow", "chair"],
    "rabbit" : ["banana", "rabbit", "paper"],
    "horse" : ["leg", "horse", "bear"],
    "lion" : ["pen", "lion", "solt"],
    "cherry" : ["cherry", "pencil", "key"],
    "egg" : ["egg", "clock", "bus"],
    "car" : ["juice", "car", "plane"],
    "hat" : ["train", "hat", "fork"],
    "carrot" : ["table", "carrot", "cake"],
    "tomato" : ["skirt", "milk", "tomato"],
    "ice-cream" : ["ice-cream", "jam", "ball"]
  };

    // Poison (Write following month)
  const months = ["january", "february", "march", "april", "may", "june", "july", "august", "september", "october", "november", "december"];

  // Arrow (Pick the right answer)
  const geography = { 
    "Евразия" : ["Как называется самый большой материк нашей планеты?", "Евразия", "Африка", "Австралия"],
    "Россия" : ["Как называется самая большая в мире страна?", "Канада", "США", "Россия"],
    "Джомолунгма" : ["Отметь название самой высокой горы на нашей планете", "Килиманджаро", "Эльбрус", "Джомолунгма"],
    "Аравийский" : ["Отметь название самого большого полуострова на нашей планете", "Аравийский", "Камчатка", "Индостан"],
    "Байкал" : ["Как называется самое глубокое озеро на нашей планете?", "Онежское", "Байкал", "Ладожское"],
    "Каспийское море" : ["Отметь название самого большого озера на нашей планете", "Каспийское море", "Мёртвое море", "Байкал"],
    "Гепард " : ["Назови самое быстрое млекопитающее в мире", "лев", "гепард ", "антилопа гну"],
    "Ватикан" : ["Назови самую маленькую страну в мире", "Люксембург", "Монако", "Ватикан"],
    "Анхель" : ["Назови самый высокий водопад", "Анхель", "Ниагарский", "Тугела"],
    "кит" : ["Назови самое большое животное в мире", "кит", "слон", "носорог"],
    "Амазонка" : ["Назови самую длинную реку в мире", "Нил", "Амазонка", "Конго"],
    "Гренландия" : ["Назови самый большой остров в мире", "Мадагаскар", "Новая Гвинея", "Гренландия"],
    "Тихий" : ["Назови самый большой океан", "Атлантический", "Тихий", "Индийский"],
    "Сахара" : ["Назови самую большую пустыню", "Сахара", "Антарктическая", "Арктическая"],
    "Австралия" : ["Назови самый маленький материк", "Австралия", "Африка", "Антарктида"]
  };
  
  // Fireball (Define subject and predicate)
  const sentenceParts = [
    {
      "subject": ["грачи"],
      "predicate": ["облюбовали"],
      "sentence": "Молодые грачи облюбовали одно дерево."
    },
    {
      "subject": ["Умный", "умный"],
      "predicate": ["не", "пойдет", "обойдет."],
      "sentence": "Умный в гору не пойдет, умный гору обойдет."
    },
    {
      "subject": ["Уснувший", "поезд"],
      "predicate": ["не","заметил", "уехал"],
      "sentence": "Уснувший не заметил, что поезд уехал в депо."
    },
    {
      "subject": ["трое."],
      "predicate": ["шли"],
      "sentence": "Навстречу ему шли трое."
    },
    {
      "subject": ["Кто"],
      "predicate": ["накормит"],
      "sentence": "Кто накормит кота?"
    },
    {
      "subject": ["медвежья", "услуга" ],
      "predicate": ["помешала"],
      "sentence": "Эта медвежья услуга помешала ему сдать зачет с первого раза."
    },
    {
      "subject": ["что-то", "хулиганское."],
      "predicate": ["есть"],
      "sentence": "В каждом коте есть что-то хулиганское."
    },
    {
      "subject": ["три","кота." ],
      "predicate": ["сидели"],
      "sentence": "На крыше сидели три кота."
    },
    {
      "subject": ["Мы", "с", "Тамарой"],
      "predicate": ["ходим"],
      "sentence": "Мы с Тамарой ходим парой."
    },
    {
      "subject": [""],
      "predicate": ["Люблю"],
      "sentence": "Люблю дождь."
    },
    {
      "subject": [""],
      "predicate": ["нужно", "поспать."],
      "sentence": "Иногда коту нужно просто поспать."
    },
    {
      "subject": ["Франсуа"],
      "predicate": ["кот."],
      "sentence": "Франсуа — кот."
    },
    {
      "subject": ["Я"],
      "predicate": ["студент."],
      "sentence": "Я будущий студент."
    },
    {
      "subject": [""],
      "predicate": ["можно", "гулять"],
      "sentence": "В этом парке можно гулять целый день."
    },
    {
      "subject": ["Наши"],
      "predicate": ["уходили"],
      "sentence": "Наши уходили все дальше и дальше."
    }
  ];

  window.tasks = {
    mathOperations : mathOperations,
    capitals : capitals,
    dictionary : dictionary,
    spellСheck : spellСheck,
    insertLetter : insertLetter,
    speechPart : speechPart,
    phoneticAnalysis : phoneticAnalysis,
    lettersTypes : lettersTypes,
    alphabet : alphabet,
    lettersToCompose : lettersToCompose,
    translation : translation,
    months: months,
    geography : geography,
    sentenceParts : sentenceParts
  }
      
  })();